// ignore_for_file: prefer_const_constructors
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:project_620710131/models/final2.dart';
import 'package:project_620710131/pages/final/final_details_page2.dart';

class FinalListPage extends StatefulWidget {
  const FinalListPage({Key? key}) : super(key: key);

  @override
  State<FinalListPage> createState() => _FinalListPageState();
}

class _FinalListPageState extends State<FinalListPage> {
  List<Final2> finales = [
    Final2(
        ep: 'EP 1',
        title: 'ตอน แฝดเทวดาแห่งย่านเมืองเก่าไงล่ะ',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/015.jpg'),
    Final2(
        ep: 'EP 2',
        title: 'ตอน ชิเซล่าปรากฏตัว',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/016.jpg'),
    Final2(
        ep: 'EP 3',
        title: 'ตอน โอ้ จาปอน',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/017.jpg'),
    Final2(
        ep: 'EP 4',
        title: 'ตอน อยากไปงานเทศกาลจังเลย',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/018.jpg'),
    Final2(
        ep: 'EP 5',
        title: 'ตอน โอเน่คือเจ้าหญิง',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/019.jpg'),
    Final2(
        ep: 'EP 6',
        title: 'ตอน โรงเรียนอนุบาล',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/020.jpg'),
    Final2(
        ep: 'EP 7',
        title: 'ตอน เปียโนของโอเน่',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/021.jpg'),
    Final2(
        ep: 'EP 8',
        title: 'ตอน เรียนรู้ที่บ้านนา',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/022.jpg'),
    Final2(
        ep: 'EP 9',
        title: 'ตอน หมุนเสี่ยงดวงสุดซวย',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/023.jpg'),
    Final2(
        ep: 'EP 10',
        title: 'ตอน ร้องรำที่โรงเรียน',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/024.jpg'),
    Final2(
        ep: 'EP 11',
        title: 'ตอน เมอร์รีคริสต์มาส',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/025.jpg'),
    Final2(
        ep: 'EP 12',
        title: 'ตอน ยังอีกหรอ ส.ค.ส.',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/026.jpg'),
    Final2(
        ep: 'EP 13',
        title: 'ตอน ที่นี่คือแดนหิมะ',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/027.jpg'),
    Final2(
        ep: 'EP 14',
        title: 'ตอน ไปปารีสกันสองคน',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/028.jpg'),
    Final2(
        ep: 'EP 15',
        title: 'ตอน พี่น้องทะเลาะกัน',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/029.jpg'),
    Final2(
        ep: 'EP 16',
        title: 'ตอน ปาร์ตี้วันเกิดของคาเอเดะ',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/030.jpg'),
    Final2(
        ep: 'EP 17',
        title: 'ตอน ฝึกตนที่วัดวา',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/031.jpg'),
    Final2(
        ep: 'EP 18',
        title: 'ตอน สวัสดีจากแดนใต้',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/032.jpg'),
    Final2(
        ep: 'EP 19',
        title: 'ตอน เลียนแบบรถไฟ',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/033.jpg'),
    Final2(
        ep: 'EP 20',
        title: 'ตอน หาสกู๊ปข่าวกัน',
        description: 'เรื่องย่อ คู่แฝดโอเนและจุนอิจิโร่ที่อาศัยอยู่ในเมืองดงกุริซากะ โอเน สาวน้อยใสซื่อกับหน้าผากมันเงาแสนกว้างของเธอที่เชิญชวนให้ทุกคนมาลูบเพื่อความโชคดี ส่วนจุนอิจิโร่ หนุ่มน้อยแสนฉลาดขี้กังวล ที่ชอบอ่านหนังสือภาพและเล่นกับด้วง ทั้งคู่ต้องอยู่ที่บ้านกันสองคนเพราะพ่อแม่ของพวกเขาต้องทำงานที่ต่างประเทศ ทว่าชีวิตที่แสนจะไม่ธรรมดาก็ทำอะไรคู่แฝดนี้ไม่ได้ เพราะได้รับการดูแลจากเพื่อนบ้านที่แสนเป็นมิตร เรื่องราวในทุกๆ ตอนจะอบอวลไปด้วยความรักและความอบอุ่นที่รอทักทายคู่แฝดขณะพวกเขาออกไปใช้ชีวิตประจำวัน',
        imageUrl: 'assets/images/034.jpg'),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: ListView.builder(
        itemCount: finales.length,
        itemBuilder: (BuildContext context, int index) {
          var final2 = finales[index];
          var descriptionstylec = const TextStyle(
              fontSize: 13.0,
              color: Colors.black54,
              overflow: TextOverflow.ellipsis);
          return Card(
            child: InkWell(
              onTap: () {
                _handleClickFinalItem(finales[index]);
              },
              child: Padding(
                padding: EdgeInsets.all(16.0),
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Row(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: [
                        Image.asset(
                          final2.imageUrl,
                          width: 100.0,
                          height: 60.0,
                          fit: BoxFit.cover,
                        ),
                        SizedBox(width: 10.0),
                        Expanded(
                          child: Column(
                            crossAxisAlignment: CrossAxisAlignment.start,
                            children: [
                              Text(final2.ep, style: GoogleFonts.itim(fontSize: 18.0, color: Colors.blue.shade300),),
                              SizedBox(height: 8.0),
                              Text(final2.title, style: GoogleFonts.mali(fontSize: 12.0, color: Colors.orange.shade300),),
                            ],
                          ),
                        ),
                      ],
                    )
                  ],
                ),
              ),
            ),
          );
        },
      ),
    );
  }

  void _handleClickFinalItem(Final2 p) {
    print(p.imageUrl.toString());
    Navigator.push(
      context,
      MaterialPageRoute(builder: (context) => FinalDetailsPage2(final2: p)),
    );
  }
}
